{
  "movies": [
    {
      "id": "1",
      "title": "The Shawshank Redemption",
      "poster": "/assets/1.jpg",
      "year": "1994",
      "duration": "2h 22min",
      "rate": 9.2,
      "description":
        "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.",
      "genre": "Drama"
    },
    {
      "id": "2",
      "title": "The Godfather",
      "poster": "/assets/2.jpg",
      "year": "1972",
      "duration": "2h 55min",
      "rate": 9.2,
      "description":
        "The aging patriarch of an organized crime dynasty in postwar New York City transfers control of his clandestine empire to his reluctant youngest son.",
      "genre": "Drama"
    },
    {
      "id": "3",
      "title": "The Godfather: Part II",
      "poster": "/assets/3.jpg",
      "year": "1974",
      "duration": "3h 22min",
      "rate": 9.0,
      "description":
        "The early life and career of Vito Corleone in 1920s New York City is portrayed, while his son, Michael, expands and tightens his grip on the family crime syndicate.",
      "genre": "Drama"
    },
    {
      "id": "4",
      "title": "The Dark Knight",
      "poster": "/assets/4.jpg",
      "year": "2008",
      "duration": "2h 32min",
      "rate": 9.0,
      "description":
        "When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.",
      "genre": "Action"
    },
    {
      "id": "5",
      "title": "12 Angry Men",
      "poster": "/assets/5.jpg",
      "year": "1957",
      "duration": "1h 36min",
      "rate": 9.0,
      "description":
        "The jury in a New York City murder trial is frustrated by a single member whose skeptical caution forces them to more carefully consider the evidence before jumping to a hasty verdict.",
      "genre": "Crime"
    },
    {
      "id": "6",
      "title": "Schindler's List",
      "poster": "/assets/6.jpg",
      "year": "1993",
      "duration": "3h 15min",
      "rate": 8.9,
      "description":
        "In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.",
      "genre": "Biography"
    },
    {
      "id": "7",
      "title": "The Lord of the Rings: The Return of the King",
      "poster": "/assets/7.jpg",
      "year": "2003",
      "duration": "3h 21min",
      "rate": 8.9,
      "description":
        "Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.",
      "genre": "Crime"
    },
    {
      "id": "8",
      "title": "Pulp Fiction",
      "poster": "/assets/8.jpg",
      "year": "1994",
      "duration": "2h 34min",
      "rate": 8.9,
      "description":
        "The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.",
      "genre": "Drama"
    },
    {
      "id": "9",
      "title": "The Good, the Bad and the Ugly",
      "poster": "/assets/9.jpg",
      "year": "1966",
      "duration": "2h 58min",
      "rate": 8.8,
      "description":
        "A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.",
      "genre": "Western"
    },
    {
      "id": "10",
      "title": "The Lord of the Rings: The Fellowship of the Ring",
      "poster": "/assets/10.jpg",
      "year": "2001",
      "duration": "2h 58min",
      "rate": 8.8,
      "description":
        "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.",
      "genre": "Crime"
    }
  ]
}